using System;
/*
 Колоквијум из Објектно оријентисаног програмирања II
1) (укупно 70 поена) Саставити на језику Java следећи пакет класа:
 (10 поена) Морнар има име и квалитет који се задају приликом стварања и који могу да се
дохвате. Квалитет је цео број у опсегу 0-100 (вредност већа од 100 или мања од 0 постављају
квалитет на вредност 100 и 0 респективно). Може да се састави текстуални опис морнара у
облику М_име : квалитет.
 (25 поена) Брод има назив и може да садржи задати број морнара као посаду. Ствара се са
задатим називом, бројем морнара који може да садржи и једним од тих морнара који у том
тренутку представља капетана брода (не треба проверавати исправност унетих података).
Капетан брода је увек тренутно најквалитетнији морнар на броду и може да се дохвати
(покушај дохватања капетана из празног брода је регуларна ситуација у којој треба вратити
одговарајућу вредност). Морнар се може додати на брод, може да се дохвати морнар са
задатим индексом (грешка је уколико је индекс изван опсега - GIndeks), да се одреди индекс
најгорег морнара, да се узме најбољи морнар, да се дохвати тренутни број морнара на броду,
да се одреди једнословна врста брода и да се уклоне сви морнари са брода. Може да се
израчуна реалан квалитет посаде брода као просечна вредност квалитета свих морнара. Брод
може да нападне други брод само ако је испуњен одређени услов, а у том случају се бори са
тим бродом. Побеђује брод са квалитетнијом посадом, без обзира на бројност посаде.
Победнички брод уклања комплетну посаду са пораженог брода, а неке од њих преузима.
Може да се састави текстуални опис брода у облику врста - назив : квалитет_посаде,
након чега се у новом реду исписују морнари брода у облику (морнар, морнар, ...,
морнар).
 (10 поена) Гусарски брод је брод који може да нападне само брод чија је посада мање бројна
од његове. Након успешног напада узима са пораженог брода и додаје у своју посаду
капетана нападнутог брода само ако је он квалитетнији од морнара са најмањим квалитетом
унутар те посаде и на броду има слободног места. Врста гусарског брода је G.
 (10 поена) Краљевски брод је брод који може да нападне само брод који није краљевски.
Након успешног напада, посаду краљевског брода треба допунити (највише до расположивог
капацитета) морнарима са пораженог брода који су квалитетнији од најмање квалитетног
морнара са брода победника. Морнаре са пораженог брода узимати по опадајућем редоследу
њиховог квалитета. Врста краљевског брода је К.
 (15 поена) Флота има назив и садржи произвољан број бродова. Ствара се празна, са
задатим називом, после чега јој се бродови могу додавати редом, један по један. Први додати
брод одређује врсту бродова који се могу додавати у флоту (грешка је уколико је брод који се
додаје неадекватан - GNeadekvatan). Може да се дохвати брод са задатим индексом (грешка
је уколико је индекс изван опсега - GIndeks), као и да се одреди реалан квалитет флоте као
просечна вредност квалитета свих појединачних бродова. Може да се састави текстуални
опис флоте у облику Flota(врста) назив : квалитет, након чега се у новим редовима
исписују појединачни бродови, по један брод у реду. Пре него што се дода први брод у
флоту, врста је – (цртица).
(0 поена). Приложена је класа са главном функцијом која испитује основне функционалности
пакета класа уз исписивање резултата на стандардном излазу (конзоли).
НАПОМЕНЕ: а) Израда решења задатка траје 100 минута.
б) Рад се предаје искључиво на предвиђеном мрежном диску.
в) Називе типова и метода ускладити са називима из приложене класе са главном функцијом.
г) На располагању je приступ Web адреси: https://docs.oracle.com/javase/8/docs/api/.
д) Није дозвољено имати поред себе друге материјале, нити уз себе имати електронске уређаје, без обзира да ли су
укључени или искључени.
 */
namespace Brodovi
{
    class Program
    {
        static void Main(string[] args)
        {
            /*
            Mornar m1 = new Mornar("A", 50), m2 = new Mornar("B", 100), m3 = new Mornar("C", 60), m4 = new Mornar("D", 40);
            GusarskiBrod g1 = new GusarskiBrod("Pearl", 5, m1);
            KraljevskiBrod k1 = new KraljevskiBrod("St. John", 2, m3);
            try
            {
                g1.dodajMorn(m2);
                g1.dodajMorn(new Mornar("E", 60));
                k1.dodajMorn(m4);
                Console.WriteLine("Broj mornara na gusarskom brodu: " + g1.dohvBr());
                Console.WriteLine("Kapetan gusarskog broda: " + g1.dohvatiKapetana());
                try
                {
                    Console.WriteLine("Mornar kraljevskog broda na poziciji 1: " + k1.dohvMorn(1));
                }
                catch (GIndeks e) { }
                Console.WriteLine("*** Ispis brodova ***");
                Console.WriteLine(g1);
                Console.WriteLine(k1);
                g1.napadni(k1);
                Console.WriteLine("*** Ispis brodova nakon napada ***");
                Console.WriteLine(g1);
                Console.WriteLine(k1);
                Flota flota = new Flota("F");
                flota.dodaj(k1);
                try
                {
                    flota.dodaj(g1); //neuspesno dodavanje gusarskog broda u flotu
                }
                catch (GNeadekvatan e) { }
                flota.dodaj(new KraljevskiBrod("Santa Maria", 3, new Mornar("F", 40)));
                Console.WriteLine("*** Izgled flote ***");
                Console.WriteLine(flota);
                flota.dohvBrod(0).dodajMorn(new Mornar("G", 50));
                Console.WriteLine("*** Nakon obnove flote ***");
                Console.WriteLine(flota);
            }
            catch (Exception e)
            {
                Console.WriteLine(e);
            }
            */
        }
    }
    //Primer izvrsavanja
    /*
    Broj mornara na gusarskom brodu: 3
Kapetan gusarskog broda: M_B : 100
Mornar kraljevskog broda na poziciji 1: M_D : 40
*** Ispis brodova***
G - Pearl : 70.0
(M_A : 50, M_B : 100, M_E : 60)
K - St.John : 50.0
(M_C : 60, M_D : 40)
*** Ispis brodova nakon napada***
G - Pearl : 67.5
(M_A : 50, M_B : 100, M_E : 60, M_C : 60)
K - St.John : 0.0
()
*** Izgled flote***
Flota(K) F : 20.0
K - St.John : 0.0
()
K - Santa Maria : 40.0
(M_F : 40)
*** Nakon obnove flote ***
Flota(K) F : 45.0
K - St.John : 50.0
(M_G : 50)
K - Santa Maria : 40.0
(M_F : 40)
    */
        
    
}
